Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLineAttributes.DrawTextAtStartOfGridLine Property
 Set as true if you want to show the grid line's text label at the start of the line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawTextAtStartOfGridLine { get; set; }
Public Property DrawTextAtStartOfGridLine As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace